src/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоставщика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/НоменклатураКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>НоменклатураКонтрагентов</Name>
			<Owners>
				<xr:Item>Catalog.Партнеры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НоменклатураБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВладелецНоменклатуры</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецНоменклатурыБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/ФормаСравненияПредложенийПоставщиков/Ext/Form/Module.bsl
&НаСервере 
Функция ДобавитьРеквизитВТаблицаЦенПоставщиков(ИмяРеквизита,ТипРеквизита,ПостфиксИмениРеквизита,ЗаголовокРеквизита)
	
	ТипыРеквизита = Новый Массив;
	ТипыРеквизита.Добавить(Тип(ТипРеквизита));
	ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита);
	
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита+ПостфиксИмениРеквизита,  // имя
	ОписаниеТиповДляРеквизита,             // тип
	"ТаблицаЦенПоставщиков",   // путь
	ЗаголовокРеквизита);// заголовок
	
	Возврат НовыйРеквизит ;
	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ЗаказКлиента = Параметры.ЗаказКлиента;
	Иначе
		Возврат;
	КонецЕсли;		

	
	// Вставить содержимое обработчика.  
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК КоличествоВЗаказе
		|ПОМЕСТИТЬ ТоварыЗаказа
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &СсылкаНаЗаказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураКонтрагентов.Ссылка КАК НоменклатураКонтрагента,
		|	НоменклатураКонтрагентов.Владелец КАК Поставщик,
		|	НоменклатураКонтрагентов.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТоварыКонтрагентов
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|
		|СГРУППИРОВАТЬ ПО
		|	НоменклатураКонтрагентов.Владелец,
		|	НоменклатураКонтрагентов.Ссылка,
		|	НоменклатураКонтрагентов.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыКонтрагентов.Поставщик КАК Поставщик
		|ИЗ
		|	ТоварыКонтрагентов КАК ТоварыКонтрагентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТоварыКонтрагентов.Поставщик, ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)) КАК Поставщик,
		|	ТоварыЗаказа.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ТоварыКонтрагентов.НоменклатураКонтрагента, ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)) КАК НоменклатураКонтрагента,
		|	ТоварыЗаказа.КоличествоВЗаказе КАК КоличествоВЗаказе,
		|	ТоварыКонтрагентов.НоменклатураКонтрагента.КодНоменклатуры КАК КодНоменклатурыКонтрагента
		|ИЗ
		|	ТоварыЗаказа КАК ТоварыЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКонтрагентов КАК ТоварыКонтрагентов
		|		ПО ТоварыЗаказа.Номенклатура = ТоварыКонтрагентов.Номенклатура
		|ИТОГИ
		|	СУММА(КоличествоВЗаказе)
		|ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("СсылкаНаЗаказ", Параметры.ЗаказКлиента);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаПоставщик = РезультатЗапроса[2].Выбрать(); //Выборка всех поставщиков по номенклатуре заказа
	Пока ВыборкаПоставщик.Следующий() Цикл //Перебираем поставщиков и создаем для каждого поля колонки
		// Вставить обработку выборки ВыборкаПоставщик

// Добавить реквизит c двумя колонками.
    //Цена
	//Номенклатура поставщика 
		Если ЗначениеЗаполнено(ВыборкаПоставщик.Поставщик) Тогда 
			ПостфиксИмениРеквизита = СтрЗаменить(ВыборкаПоставщик.Поставщик.УникальныйИдентификатор(), "-", ""); 

			ДобавляемыеРеквизиты = Новый Массив;
			ДобавляемыеРеквизиты.Добавить(
					ДобавитьРеквизитВТаблицаЦенПоставщиков("Цена","Число",
															ПостфиксИмениРеквизита,
															"Цена "+ВыборкаПоставщик.Поставщик.Наименование
															)
					);

			ДобавляемыеРеквизиты.Добавить(
					ДобавитьРеквизитВТаблицаЦенПоставщиков("НоменклатураКонтрагента","СправочникСсылка.НоменклатураКонтрагентов",
															ПостфиксИмениРеквизита,
															"Номенклатура "+ВыборкаПоставщик.Поставщик.Наименование
															)
					);
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);  


			НовыйЭлементЦена = Элементы.Добавить("Цена"+ПостфиксИмениРеквизита, Тип("ПолеФормы"), Элементы.ТаблицаЦенПоставщиков);	
			НовыйЭлементЦена.ПутьКДанным = "ТаблицаЦенПоставщиков.Цена"+ПостфиксИмениРеквизита;
			НовыйЭлементЦена.Вид = ВидПоляФормы.ПолеВвода;

			НовыйЭлемент = Элементы.Добавить("НоменклатураКонтрагента"+ПостфиксИмениРеквизита, Тип("ПолеФормы"), Элементы.ТаблицаЦенПоставщиков);	
			НовыйЭлемент.ПутьКДанным = "ТаблицаЦенПоставщиков.НоменклатураКонтрагента"+ПостфиксИмениРеквизита;
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;		
	КонецЦикла;
	
//Пока потренируемся на одном русском свете
    ТаблицаЦен = ИнтерфейсАпиСервер.ИнициализироватьТаблицуЦенНоменклатурыКонтрагентов();
	ВыборкаТовары = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаТовары.Следующий() Цикл //Создаем строки с номенклатурой и заполняем цены и номенклатуру поставщиков

		СтрокаТаблицы = ТаблицаЦенПоставщиков.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаТовары); 
		ДетальныеЗаписи = ВыборкаТовары.Выбрать();
		Пока ДетальныеЗаписи.Следующий() Цикл     
			Если ЗначениеЗаполнено(ВыборкаПоставщик.Поставщик) Тогда 
				ПостфиксИмениРеквизита = СтрЗаменить(ДетальныеЗаписи.Поставщик.УникальныйИдентификатор(), "-", ""); 
				СвойстваКолонки = Новый Структура;
				СвойстваКолонки.Вставить("Цена"+ПостфиксИмениРеквизита,0);
				СвойстваКолонки.Вставить("НоменклатураКонтрагента"+ПостфиксИмениРеквизита,ДетальныеЗаписи.НоменклатураКонтрагента);
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы,СвойстваКолонки);
				
				Если ЗначениеЗаполнено(ДетальныеЗаписи.НоменклатураКонтрагента) Тогда
					СтрокаТаблицыЦен = ТаблицаЦен.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыЦен,ДетальныеЗаписи);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	РезультатЗаполнения = Обработки.ИнтерфейсAPIРусскийСвет.ЗаполнитьЦеныНоменклатурыВТаблице(ТаблицаЦен); 
	
	Если РезультатЗаполнения Тогда //Обновим данные о ценах по таблице
		Для Каждого СтрокаТаблицыЦен из ТаблицаЦен Цикл
			МассивСтрок =  ТаблицаЦенПоставщиков.НайтиСтроки(Новый Структура("Номенклатура",СтрокаТаблицыЦен.Номенклатура));
			//ИмяКолонкиЦена = СтрЗаменить(ВыборкаПоставщик.Поставщик.УникальныйИдентификатор(), "-", "");
			//ЗаполнитьЗначенияСвойств(СтрокаТаблицыЦен,ДетальныеЗаписи,)  
			МассивСтрок[0].Ценаdd8f52aeaec411eea1aaa8a159ec21b0 = СтрокаТаблицыЦен.Цена; //в тупняк полный это русский свет
		КонецЦикла
	КонецЕсли
КонецПроцедуры
